var rule = {
    title: '热播之家',
    host: 'https://rebozj.pro',
    url: '/show/fyfilter.html',
    filterable: 1,
    filter_url: '{{fl.cateId}}-{{fl.area}}-{{fl.by or "time"}}-{{fl.class}}-{{fl.lang}}-{{fl.letter}}---fypage---{{fl.year}}',
    filter: {
        '1': [
            {
                key: 'cateId',
                name: '按类型',
                value: [
                    {
                        n: '全部',
                        v: '1',
                    },
                    {
                        n: '动作',
                        v: '6',
                    },
                    {
                        n: '喜剧',
                        v: '7',
                    },
                    {
                        n: '爱情',
                        v: '8',
                    },
                    {
                        n: '科幻',
                        v: '9',
                    },
                    {
                        n: '恐怖',
                        v: '10',
                    },
                    {
                        n: '剧情',
                        v: '11',
                    },
                    {
                        n: '战争',
                        v: '12',
                    },
                ],
            },
            {
                key: 'class',
                name: '按剧情',
                value: [
                    {
                        n: '全部',
                        v: '',
                    },
                    {
                        n: '剧情',
                        v: '剧情',
                    },
                    {
                        n: '喜剧',
                        v: '喜剧',
                    },
                    {
                        n: '动作',
                        v: '动作',
                    },
                    {
                        n: '爱情',
                        v: '爱情',
                    },
                    {
                        n: '惊悚',
                        v: '惊悚',
                    },
                    {
                        n: '恐怖',
                        v: '恐怖',
                    },
                    {
                        n: '犯罪',
                        v: '犯罪',
                    },
                    {
                        n: '悬疑',
                        v: '悬疑',
                    },
                    {
                        n: '冒险',
                        v: '冒险',
                    },
                    {
                        n: '科幻',
                        v: '科幻',
                    },
                    {
                        n: '奇幻',
                        v: '奇幻',
                    },
                    {
                        n: '战争',
                        v: '战争',
                    },
                    {
                        n: '家庭',
                        v: '家庭',
                    },
                    {
                        n: '历史',
                        v: '历史',
                    },
                    {
                        n: '古装',
                        v: '古装',
                    },
                    {
                        n: '传记',
                        v: '传记',
                    },
                    {
                        n: '武侠',
                        v: '武侠',
                    },
                    {
                        n: '音乐',
                        v: '音乐',
                    },
                    {
                        n: '运动',
                        v: '运动',
                    },
                    {
                        n: '歌舞',
                        v: '歌舞',
                    },
                    {
                        n: '西部',
                        v: '西部',
                    },
                    {
                        n: '灾难',
                        v: '灾难',
                    },
                ],
            },
            {
                key: 'area',
                name: '按地区',
                value: [
                    {
                        n: '全部',
                        v: '',
                    },
                    {
                        n: '大陆',
                        v: '大陆',
                    },
                    {
                        n: '香港',
                        v: '香港',
                    },
                    {
                        n: '台湾',
                        v: '台湾',
                    },
                    {
                        n: '美国',
                        v: '美国',
                    },
                    {
                        n: '法国',
                        v: '法国',
                    },
                    {
                        n: '英国',
                        v: '英国',
                    },
                    {
                        n: '日本',
                        v: '日本',
                    },
                    {
                        n: '韩国',
                        v: '韩国',
                    },
                    {
                        n: '德国',
                        v: '德国',
                    },
                    {
                        n: '泰国',
                        v: '泰国',
                    },
                    {
                        n: '印度',
                        v: '印度',
                    },
                    {
                        n: '意大利',
                        v: '意大利',
                    },
                    {
                        n: '西班牙',
                        v: '西班牙',
                    },
                    {
                        n: '加拿大',
                        v: '加拿大',
                    },
                    {
                        n: '其他',
                        v: '其他',
                    },
                ],
            },
            {
                key: 'year',
                name: '按年份',
                value: [
                    {
                        n: '全部',
                        v: '',
                    },
                    {
                        n: '2024',
                        v: '2024',
                    },
                    {
                        n: '2023',
                        v: '2023',
                    },
                    {
                        n: '2022',
                        v: '2022',
                    },
                    {
                        n: '2021',
                        v: '2021',
                    },
                    {
                        n: '2020',
                        v: '2020',
                    },
                    {
                        n: '2019',
                        v: '2019',
                    },
                    {
                        n: '2018',
                        v: '2018',
                    },
                    {
                        n: '2017',
                        v: '2017',
                    },
                    {
                        n: '2016',
                        v: '2016',
                    },
                    {
                        n: '2015',
                        v: '2015',
                    },
                    {
                        n: '2014',
                        v: '2014',
                    },
                    {
                        n: '2013',
                        v: '2013',
                    },
                    {
                        n: '2012',
                        v: '2012',
                    },
                    {
                        n: '2011',
                        v: '2011',
                    },
                    {
                        n: '2010',
                        v: '2010',
                    },
                ],
            },
            {
                key: 'lang',
                name: '按语言',
                value: [
                    {
                        n: '全部',
                        v: '',
                    },
                    {
                        n: '国语',
                        v: '国语',
                    },
                    {
                        n: '英语',
                        v: '英语',
                    },
                    {
                        n: '粤语',
                        v: '粤语',
                    },
                    {
                        n: '闽南语',
                        v: '闽南语',
                    },
                    {
                        n: '韩语',
                        v: '韩语',
                    },
                    {
                        n: '日语',
                        v: '日语',
                    },
                    {
                        n: '法语',
                        v: '法语',
                    },
                    {
                        n: '德语',
                        v: '德语',
                    },
                    {
                        n: '其它',
                        v: '其它',
                    },
                ],
            },
            {
                key: 'by',
                name: '排序',
                value: [
                    {
                        n: '时间',
                        v: 'time',
                    },
                    {
                        n: '人气',
                        v: 'hits',
                    },
                    {
                        n: '评分',
                        v: 'score',
                    },
                ],
            },
        ],
        '2': [
            {
                key: 'cateId',
                name: '按类型',
                value: [
                    {
                        n: '全部',
                        v: '2',
                    },
                    {
                        n: '国产剧',
                        v: '13',
                    },
                    {
                        n: '港台剧',
                        v: '14',
                    },
                    {
                        n: '日韩剧',
                        v: '15',
                    },
                    {
                        n: '海外剧',
                        v: '16',
                    },
                ],
            },
            {
                key: 'class',
                name: '按剧情',
                value: [
                    {
                        n: '全部',
                        v: '',
                    },
                    {
                        n: '爱情',
                        v: '爱情',
                    },
                    {
                        n: '剧情',
                        v: '剧情',
                    },
                    {
                        n: '香港',
                        v: '香港',
                    },
                    {
                        n: '犯罪',
                        v: '犯罪',
                    },
                    {
                        n: '战争',
                        v: '战争',
                    },
                    {
                        n: '悬疑',
                        v: '悬疑',
                    },
                    {
                        n: '恐怖',
                        v: '恐怖',
                    },
                    {
                        n: '古装',
                        v: '古装',
                    },
                    {
                        n: '武侠',
                        v: '武侠',
                    },
                    {
                        n: '冒险',
                        v: '冒险',
                    },
                    {
                        n: '动作',
                        v: '动作',
                    },
                    {
                        n: '奇幻',
                        v: '奇幻',
                    },
                    {
                        n: '喜剧',
                        v: '喜剧',
                    },
                    {
                        n: '惊悚',
                        v: '惊悚',
                    },
                    {
                        n: '家庭',
                        v: '家庭',
                    },
                    {
                        n: '历史',
                        v: '历史',
                    },
                    {
                        n: '科幻',
                        v: '科幻',
                    },
                    {
                        n: '国产',
                        v: '国产',
                    },
                    {
                        n: '欧美',
                        v: '欧美',
                    },
                    {
                        n: '日本',
                        v: '日本',
                    },
                    {
                        n: '韩国',
                        v: '韩国',
                    },
                    {
                        n: '海外',
                        v: '海外',
                    },
                    {
                        n: '泰国',
                        v: '泰国',
                    },
                    {
                        n: '台湾',
                        v: '台湾',
                    },
                ],
            },
            {
                key: 'area',
                name: '按地区',
                value: [
                    {
                        n: '全部',
                        v: '',
                    },
                    {
                        n: '内地',
                        v: '内地',
                    },
                    {
                        n: '韩国',
                        v: '韩国',
                    },
                    {
                        n: '香港',
                        v: '香港',
                    },
                    {
                        n: '台湾',
                        v: '台湾',
                    },
                    {
                        n: '日本',
                        v: '日本',
                    },
                    {
                        n: '美国',
                        v: '美国',
                    },
                    {
                        n: '泰国',
                        v: '泰国',
                    },
                    {
                        n: '英国',
                        v: '英国',
                    },
                    {
                        n: '新加坡',
                        v: '新加坡',
                    },
                    {
                        n: '其他',
                        v: '其他',
                    },
                ],
            },
            {
                key: 'year',
                name: '按年份',
                value: [
                    {
                        n: '全部',
                        v: '',
                    },
                    {
                        n: '2024',
                        v: '2024',
                    },
                    {
                        n: '2023',
                        v: '2023',
                    },
                    {
                        n: '2022',
                        v: '2022',
                    },
                    {
                        n: '2021',
                        v: '2021',
                    },
                    {
                        n: '2020',
                        v: '2020',
                    },
                    {
                        n: '2019',
                        v: '2019',
                    },
                    {
                        n: '2018',
                        v: '2018',
                    },
                    {
                        n: '2017',
                        v: '2017',
                    },
                    {
                        n: '2016',
                        v: '2016',
                    },
                    {
                        n: '2015',
                        v: '2015',
                    },
                    {
                        n: '2014',
                        v: '2014',
                    },
                    {
                        n: '2013',
                        v: '2013',
                    },
                    {
                        n: '2012',
                        v: '2012',
                    },
                    {
                        n: '2011',
                        v: '2011',
                    },
                    {
                        n: '2010',
                        v: '2010',
                    },
                ],
            },
            {
                key: 'lang',
                name: '按语言',
                value: [
                    {
                        n: '全部',
                        v: '',
                    },
                    {
                        n: '国语',
                        v: '国语',
                    },
                    {
                        n: '英语',
                        v: '英语',
                    },
                    {
                        n: '粤语',
                        v: '粤语',
                    },
                    {
                        n: '闽南语',
                        v: '闽南语',
                    },
                    {
                        n: '韩语',
                        v: '韩语',
                    },
                    {
                        n: '日语',
                        v: '日语',
                    },
                    {
                        n: '其它',
                        v: '其它',
                    },
                ],
            },
            {
                key: 'by',
                name: '按排序',
                value: [
                    {
                        n: '时间',
                        v: 'time',
                    },
                    {
                        n: '人气',
                        v: 'hits',
                    },
                    {
                        n: '评分',
                        v: 'score',
                    },
                ],
            },
        ],
        '3': [
            {
                key: 'cateId',
                name: '按类型',
                value: [
                    {
                        n: '全部',
                        v: '3',
                    },
                ],
            },
            {
                key: 'class',
                name: '按剧情',
                value: [
                    {
                        n: '全部',
                        v: '',
                    },
                    {
                        n: '记录',
                        v: '记录',
                    },
                    {
                        n: '传记',
                        v: '传记',
                    },
                    {
                        n: '历史',
                        v: '历史',
                    },
                    {
                        n: '音乐',
                        v: '音乐',
                    },
                    {
                        n: '运动',
                        v: '运动',
                    },
                    {
                        n: '短',
                        v: '短',
                    },
                    {
                        n: '犯罪',
                        v: '犯罪',
                    },
                    {
                        n: '情',
                        v: '情',
                    },
                    {
                        n: '战争',
                        v: '战争',
                    },
                    {
                        n: '冒险',
                        v: '冒险',
                    },
                    {
                        n: '灾难',
                        v: '灾难',
                    },
                ],
            },
            {
                key: 'area',
                name: '按地区',
                value: [
                    {
                        n: '全部',
                        v: '',
                    },
                    {
                        n: '内地',
                        v: '内地',
                    },
                    {
                        n: '港台',
                        v: '港台',
                    },
                    {
                        n: '日韩',
                        v: '日韩',
                    },
                    {
                        n: '欧美',
                        v: '欧美',
                    },
                ],
            },
            {
                key: 'year',
                name: '按年份',
                value: [
                    {
                        n: '全部',
                        v: '',
                    },
                    {
                        n: '2024',
                        v: '2024',
                    },
                    {
                        n: '2023',
                        v: '2023',
                    },
                    {
                        n: '2022',
                        v: '2022',
                    },
                    {
                        n: '2021',
                        v: '2021',
                    },
                    {
                        n: '2020',
                        v: '2020',
                    },
                    {
                        n: '2019',
                        v: '2019',
                    },
                    {
                        n: '2018',
                        v: '2018',
                    },
                    {
                        n: '2017',
                        v: '2017',
                    },
                    {
                        n: '2016',
                        v: '2016',
                    },
                    {
                        n: '2015',
                        v: '2015',
                    },
                    {
                        n: '2014',
                        v: '2014',
                    },
                ],
            },
        ],
        '4': [
            {
                key: 'cateId',
                name: '按类型',
                value: [
                    {
                        n: '全部',
                        v: '4',
                    },
                    {
                        n: '国产动漫',
                        v: '24',
                    },
                    {
                        n: '日韩动漫',
                        v: '25',
                    },
                    {
                        n: '港台动漫',
                        v: '26',
                    },
                    {
                        n: '欧美动漫',
                        v: '27',
                    },
                ],
            },
            {
                key: 'class',
                name: '按剧情',
                value: [
                    {
                        n: '全部',
                        v: '',
                    },
                    {
                        n: '日韩动漫',
                        v: '日韩动漫',
                    },
                    {
                        n: '国产动漫',
                        v: '国产动漫',
                    },
                    {
                        n: '欧美动漫',
                        v: '欧美动漫',
                    },
                    {
                        n: '港台动漫',
                        v: '港台动漫',
                    },
                    {
                        n: '海外动漫',
                        v: '海外动漫',
                    },
                    {
                        n: '冒险',
                        v: '冒险',
                    },
                    {
                        n: '奇幻',
                        v: '奇幻',
                    },
                    {
                        n: '动作',
                        v: '动作',
                    },
                    {
                        n: '科幻',
                        v: '科幻',
                    },
                    {
                        n: '剧情',
                        v: '剧情',
                    },
                    {
                        n: '喜剧',
                        v: '喜剧',
                    },
                    {
                        n: '爱情',
                        v: '爱情',
                    },
                    {
                        n: '家庭',
                        v: '家庭',
                    },
                    {
                        n: '儿童',
                        v: '儿童',
                    },
                    {
                        n: '悬疑',
                        v: '悬疑',
                    },
                    {
                        n: '短',
                        v: '短',
                    },
                    {
                        n: '运动',
                        v: '运动',
                    },
                    {
                        n: '惊悚',
                        v: '惊悚',
                    },
                    {
                        n: '音乐',
                        v: '音乐',
                    },
                    {
                        n: '恐怖',
                        v: '恐怖',
                    },
                    {
                        n: '战争',
                        v: '战争',
                    },
                    {
                        n: '古装',
                        v: '古装',
                    },
                    {
                        n: '犯罪',
                        v: '犯罪',
                    },
                    {
                        n: '武侠',
                        v: '武侠',
                    },
                    {
                        n: '歌舞',
                        v: '歌舞',
                    },
                    {
                        n: '历史',
                        v: '历史',
                    },
                    {
                        n: '经典',
                        v: '经典',
                    },
                    {
                        n: '搞笑',
                        v: '搞笑',
                    },
                    {
                        n: '日本',
                        v: '日本',
                    },
                    {
                        n: '战斗',
                        v: '战斗',
                    },
                    {
                        n: '校园',
                        v: '校园',
                    },
                    {
                        n: '热血',
                        v: '热血',
                    },
                    {
                        n: '后宫',
                        v: '后宫',
                    },
                    {
                        n: '欧美',
                        v: '欧美',
                    },
                    {
                        n: '动漫',
                        v: '动漫',
                    },
                    {
                        n: '情色',
                        v: '情色',
                    },
                    {
                        n: '少女',
                        v: '少女',
                    },
                    {
                        n: '竞技',
                        v: '竞技',
                    },
                    {
                        n: '治愈',
                        v: '治愈',
                    },
                    {
                        n: '推理',
                        v: '推理',
                    },
                ],
            },
            {
                key: 'area',
                name: '按地区',
                value: [
                    {
                        n: '全部',
                        v: '',
                    },
                    {
                        n: '国产',
                        v: '国产',
                    },
                    {
                        n: '日本',
                        v: '日本',
                    },
                    {
                        n: '欧美',
                        v: '欧美',
                    },
                    {
                        n: '其他',
                        v: '其他',
                    },
                ],
            },
            {
                key: 'year',
                name: '按年份',
                value: [
                    {
                        n: '全部',
                        v: '',
                    },
                    {
                        n: '2024',
                        v: '2024',
                    },
                    {
                        n: '2023',
                        v: '2023',
                    },
                    {
                        n: '2022',
                        v: '2022',
                    },
                    {
                        n: '2021',
                        v: '2021',
                    },
                    {
                        n: '2020',
                        v: '2020',
                    },
                    {
                        n: '2019',
                        v: '2019',
                    },
                    {
                        n: '2018',
                        v: '2018',
                    },
                    {
                        n: '2017',
                        v: '2017',
                    },
                    {
                        n: '2016',
                        v: '2016',
                    },
                    {
                        n: '2015',
                        v: '2015',
                    },
                    {
                        n: '2014',
                        v: '2014',
                    },
                    {
                        n: '2013',
                        v: '2013',
                    },
                    {
                        n: '2012',
                        v: '2012',
                    },
                    {
                        n: '2011',
                        v: '2011',
                    },
                    {
                        n: '2010',
                        v: '2010',
                    },
                ],
            },
            {
                key: 'lang',
                name: '按语言',
                value: [
                    {
                        n: '全部',
                        v: '',
                    },
                    {
                        n: '国语',
                        v: '国语',
                    },
                    {
                        n: '英语',
                        v: '英语',
                    },
                    {
                        n: '粤语',
                        v: '粤语',
                    },
                    {
                        n: '闽南语',
                        v: '闽南语',
                    },
                    {
                        n: '韩语',
                        v: '韩语',
                    },
                    {
                        n: '日语',
                        v: '日语',
                    },
                    {
                        n: '其它',
                        v: '其它',
                    },
                ],
            },
            {
                key: 'by',
                name: '按排序',
                value: [
                    {
                        n: '时间',
                        v: 'time',
                    },
                    {
                        n: '人气',
                        v: 'hits',
                    },
                    {
                        n: '评分',
                        v: 'score',
                    },
                ],
            },
        ],
        '5': [
            {
                key: 'cateId',
                name: '按类型',
                value: [
                    {
                        n: '全部',
                        v: '5',
                    },
                    {
                        n: '大陆综艺',
                        v: '17',
                    },
                    {
                        n: '港台综艺',
                        v: '18',
                    },
                    {
                        n: '日韩综艺',
                        v: '20',
                    },
                    {
                        n: '欧美综艺',
                        v: '21',
                    },
                ],
            },
            {
                key: 'class',
                name: '按剧情',
                value: [
                    {
                        n: '全部',
                        v: '5',
                    },
                ],
            },
            {
                key: 'class',
                name: '按地区',
                value: [
                    {
                        n: '全部',
                        v: '5',
                    },
                ],
            },
            {
                key: 'year',
                name: '按年份',
                value: [
                    {
                        n: '全部',
                        v: '',
                    },
                    {
                        n: '2024',
                        v: '2024',
                    },
                    {
                        n: '2023',
                        v: '2023',
                    },
                    {
                        n: '2022',
                        v: '2022',
                    },
                    {
                        n: '2021',
                        v: '2021',
                    },
                    {
                        n: '2020',
                        v: '2020',
                    },
                    {
                        n: '2019',
                        v: '2019',
                    },
                    {
                        n: '2018',
                        v: '2018',
                    },
                    {
                        n: '2017',
                        v: '2017',
                    },
                    {
                        n: '2016',
                        v: '2016',
                    },
                    {
                        n: '2015',
                        v: '2015',
                    },
                    {
                        n: '2014',
                        v: '2014',
                    },
                    {
                        n: '2013',
                        v: '2013',
                    },
                    {
                        n: '2012',
                        v: '2012',
                    },
                    {
                        n: '2011',
                        v: '2011',
                    },
                    {
                        n: '2010',
                        v: '2010',
                    },
                    {
                        n: '2009',
                        v: '2009',
                    },
                    {
                        n: '2008',
                        v: '2008',
                    },
                    {
                        n: '2007',
                        v: '2007',
                    },
                    {
                        n: '2006',
                        v: '2006',
                    },
                    {
                        n: '2005',
                        v: '2005',
                    },
                    {
                        n: '2004',
                        v: '2004',
                    },
                ],
            },
            {
                key: 'lang',
                name: '按语言',
                value: [
                    {
                        n: '全部',
                        v: '',
                    },
                ],
            },
            {
                key: 'by',
                name: '排序',
                value: [
                    {
                        n: '时间',
                        v: 'time',
                    },
                    {
                        n: '人气',
                        v: 'hits',
                    },
                    {
                        n: '评分',
                        v: 'score',
                    },
                ],
            },
        ],
    },
    filter_def: {
        '1': {
            cateId: '1',
        },
        '2': {
            cateId: '2',
        },
        '3': {
            cateId: '3',
        },
        '4': {
            cateId: '4',
        },
        '5': {
            cateId: '5',
        },
    },
    searchUrl: '/type/id-.html?wd=**',
    searchable: 2,
    quickSearch: 0,
    headers: {
        'User-Agent': 'Mozilla/5.0 (Linux; U; Android 9; zh-CN; MI 9 Build/PKQ1.181121.001) AppleWebKit/537.36 (KHTML, like Gecko) Version/4.0 Chrome/57.0.2987.108 UCBrowser/12.5.5.1035 Mobile Safari/537.36',
    },
    class_parse: '.stui-header__menu li:lt(6);a&&Text;a&&href;.*/(.*?).html',
    play_parse: true,
    lazy: '',
    limit: 6,
    推荐: 'ul.stui-vodlist.clearfix;li;a&&title;.lazyload&&data-original;.pic-text&&Text;a&&href',
    double: true,
    一级: '.stui-vodlist li;a&&title;a&&data-original;.pic-text&&Text;a&&href',
    二级: {
        title: '.stui-content__detail .title&&Text;.stui-content__detail p:eq(-2)&&Text',
        img: '.stui-content__thumb .lazyload&&data-original',
        desc: '.stui-content__detail p:eq(0)&&Text;.stui-content__detail p:eq(1)&&Text;.stui-content__detail p:eq(2)&&Text',
        content: '.detail&&Text',
        tabs: '.nav.nav-tabs li',
        lists: '.stui-content__playlist:eq(#id) li',
    },
    搜索: '*;*;*;*;*',
    cate_exclude: '首页|留言|APP|下载|资讯|新闻|动态',
    tab_exclude: '猜你|喜欢|下载|剧情|热播',
    detailUrl: '',
    二级访问前: '',
    timeout: 5000,
    encoding: 'utf-8',
    search_encoding: '',
    图片来源: '',
    图片替换: '',
    play_json: [],
    pagecount: {},
    proxy_rule: '',
    sniffer: false,
    isVideo: '',
    tab_remove: [],
    tab_order: [],
    tab_rename: {},
}